{"displayTopicName":"Introspection","topicTokens":[{"text":"Introspection","type":"text"}],"paragraphsBySubtopic":{"Introspection":[{"text":"What are the types of introspection, and what are the risks and benefits of them? When is introspection self-indulgent? What sorts of information are the goal of introspection? How does concept of self affect introspection?\nOne observation follows as example.\nThe given purpose of introspection is usually to learn about oneself. There are a few reasons one might do that. Perhaps knowledge of one’s personality and nature make it easier to live life, allowing one to predict how one will respond to new situations, and to know how best to influence yourself to accomplish your goals, and to know what goals to have in the first place. These are all very practical reasons. A second type of reason might be because one is an inherently interesting thing, and one might track one’s moods and sentiments for the same reason one might track tides of history. This latter reason may be true, but it risks sending a person into paraxisms of self-absorbtion that have no inherent limit.\nThe solution I would think is to first, focus on introspection of the first type, the identification of practical information about oneself that allows one to better navigate life at one’s helm. And regarding the second type, I would think that the following perspective might help. Regarding the workings of a company, not every event is so noteworthy in and of itself, but a given fact might illustrate a general truth about companies and business and so be notable, or, a given fact might be significant in the history of the company because affects the company’s function as a company. Similarly, as one notices one’s own minutia and is distinguishing between the notable and the irrelevant, one might seek to notice and remember those things that illustrate a human trait in general, or which meaningfully effect a person’s quest to achieve their function. That will reduce significantly the amount of information that is relevant, and even that information that one does notice, one is interested to learn about humanity generally or to optimize one’s operation practically, not to wallow in self-absorption for its own sake.","type":"text"}]}}