{
 "displayTopicName": "Religion",
 "paragraphsBySubtopic": {
  "Religion": [
   {
    "text": "I'm happy to discuss religion with secular people, but there are a few oddities that seem to crop up in such discussions that I'd like to get out of the way before venturing out, so that an over-optimism at the chances of productive exchange should be our greatest liability. So, a few caveats, ",
    "type": "text"
   },
   {
    "text": "think what you like",
    "type": "local",
    "targetSubtopic": "Think what you like",
    "targetTopic": "Religion",
    "enclosingTopic": "Religion",
    "enclosingSubtopic": "Religion"
   },
   {
    "text": ", ",
    "type": "text"
   },
   {
    "text": "I'm not trying to convince you of anything",
    "type": "local",
    "targetSubtopic": "I'm not trying to convince you of anything",
    "targetTopic": "Religion",
    "enclosingTopic": "Religion",
    "enclosingSubtopic": "Religion"
   },
   {
    "text": ", ",
    "type": "text"
   },
   {
    "text": "why I'm trying to help",
    "type": "local",
    "targetSubtopic": "Why I'm trying to help",
    "targetTopic": "Religion",
    "enclosingTopic": "Religion",
    "enclosingSubtopic": "Religion"
   },
   {
    "text": ", ",
    "type": "text"
   },
   {
    "text": "my areas of knowledge",
    "type": "local",
    "targetSubtopic": "My areas of knowledge",
    "targetTopic": "Religion",
    "enclosingTopic": "Religion",
    "enclosingSubtopic": "Religion"
   },
   {
    "text": ".",
    "type": "text"
   }
  ],
  "Think what you like": [
   {
    "text": "Think whatever you like, it doesn't bother me - I live in a warm community with nice families, festive get-togethers, and pleasant activities, and the fact that there are grungy corners of the world where people do things differently doesn't trouble me.",
    "type": "text"
   }
  ],
  "I'm not trying to convince you of anything": [
   {
    "text": "I'm not trying to convince you of anything – secularism was odd initially, it was odd in the interim, and given a cursory glance at the birth rates, it will be odd in recollection; I'm less worried about the proliferation of secular views than that I might oversleep my alarm one morning and find I missed several important goodbyes. So, with that foundation in place, I'm happy to chat about the interesting, puzzling, and seemingly transient phenomena that will have been called secularism, and the ways in which it differed from views that were more common.",
    "type": "text"
   }
  ],
  "Why I'm trying to help": [
   {
    "text": "Now, there are some people very saturated with the zeitgeist who tell me, Azriel, I want to be more religious but because of my misguided acculturation, I don't know how to do it. Now, that's a pickle, and I have pity for such people, as who among us hasn't once or twice done the inadvisable, and so, I try here and there to apply myself in some small way to the conundrum.",
    "type": "text"
   }
  ],
  "My areas of knowledge": [
   {
    "text": "Also, in an attempt to sound worldly and with the times I am speaking about \"religion\", but really the only religion I am familiar with is my \"Ultra Orthodox\" Judaism, and I don't even have much in the way of expertise to offer you there, so I would be inclined to end before starting except that I imagine I compare quite flatteringly to those in whose company I would be leaving you. So for the moment, I am yours, dear reader.",
    "type": "text"
   }
  ],
  "Another aspect of arguments for and against religion is gadlus": [
   {
    "text": "that Yiddishkeit produces people who are demonstrably great, whereas secularism doesn't, and what are the chances that the Torah is just something random that aligns with the metziyus like that. – and this also sends the person looking at gadlus in its own right. Same also with the wisdom of Torah, eg market economics etc, what are the chances this is by chance, etc.",
    "type": "text"
   }
  ]
 }
}